multiphase/interFoam/RAS/DTCHullMoving/0/k.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00015;

boundaryField
{
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0.00015;
        value           uniform 0.00015;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0.00015;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.00015;
        value           uniform 0.00015;
    }
    bottom
    {
        type            symmetryPlane;
    }
    side
    {
        type            symmetryPlane;
    }
    midPlane
    {
        type            symmetryPlane;
    }
    hull
    {
        type            kqRWallFunction;
        value           uniform 0.00015;
    }
}


// ************************************************************************* //
